IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  NOMBRE-USUARIO PIC X(30).  
PROCEDURE DIVISION.
    DISPLAY "Hello World!"
    STOP RUN.
